app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "Ruby"], ["title", "mountain"], ["url", "www.example.com"], ["created_at", "2015-09-04 20:22:48.817283"], ["updated_at", "2015-09-04 20:22:48.817283"]]
---
  def create
    # make a new picture with what picture_params returns (which is a method we're calling)
    @picture = Picture.new(picture_params)
    if @picture.save